[Survived] StringLiteral
src/main.ts:17:5
 
 // Register Weather Tools
 server.tool(
-    "getWeather",
+    "",
     "Get the current weather for a given location",
     { city: z.string().describe("The city to get the weather for") },

[Survived] ObjectLiteral
src/main.ts:19:5
 server.tool(
     "getWeather",
     "Get the current weather for a given location",
-    { city: z.string().describe("The city to get the weather for") },
+    {},
     async ({ city }: { city: string }) => {
         const result = await weatherService.getWeather({ city });

[Survived] StringLiteral
src/main.ts:19:33
 server.tool(
     "getWeather",
     "Get the current weather for a given location",
-    { city: z.string().describe("The city to get the weather for") },
+    { city: z.string().describe("") },
     async ({ city }: { city: string }) => {
         const result = await weatherService.getWeather({ city });

[Survived] BlockStatement
src/main.ts:20:43
     "getWeather",
     "Get the current weather for a given location",
     { city: z.string().describe("The city to get the weather for") },
-    async ({ city }: { city: string }) => {
-        const result = await weatherService.getWeather({ city });
-        return {
-            content: [
-                {
-                    type: "text",
-                    text: result
-                }
-            ]
-        };
-    }
+    async ({ city }: { city: string }) => {}
 );
 

[Survived] ObjectLiteral
src/main.ts:21:56
     "Get the current weather for a given location",
     { city: z.string().describe("The city to get the weather for") },
     async ({ city }: { city: string }) => {
-        const result = await weatherService.getWeather({ city });
+        const result = await weatherService.getWeather({});
         return {
             content: [

[Survived] ArrayDeclaration
src/main.ts:23:22
     async ({ city }: { city: string }) => {
         const result = await weatherService.getWeather({ city });
         return {
-            content: [
-                {
-                    type: "text",
-                    text: result
-                }
-            ]
+            content: []
         };
     }

[Survived] StringLiteral
src/main.ts:25:27
         return {
             content: [
                 {
-                    type: "text",
+                    type: "",
                     text: result
                 }

[Survived] BlockStatement
src/main.ts:39:23
 
 const transport = new StdioServerTransport();
 
-async function main() {
-    await server.connect(transport);
-}
+async function main() {}
 
 main().catch(console.error);
