[Killed] StringLiteral
src/services/weather.ts:5:43
 
 export class WeatherService {
     private static readonly GEOCODING_API = "https://geocoding-api.open-meteo.com/v1/search";
-    private static readonly WEATHER_API = "https://api.open-meteo.com/v1/forecast";
+    private static readonly WEATHER_API = "";
 
     private sanitizeInput(input: string): string {
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: StringContaining "https://api.open-meteo.com/v1/forecast"
Received
       1: "https://geocoding-api.open-meteo.com/v1/search?name=London&count=1&language=en&format=json"
->     2: "?latitude=51.5074&longitude=-0.1278&hourly=temperature_2m&models=ukmo_seamless&current=temperature_2m,apparent_temperature,is_day,rain"

[Killed] BlockStatement
src/services/weather.ts:7:50
     private static readonly GEOCODING_API = "https://geocoding-api.open-meteo.com/v1/search";
     private static readonly WEATHER_API = "https://api.open-meteo.com/v1/forecast";
 
-    private sanitizeInput(input: string): string {
-        // Remove potentially dangerous characters and limit length
-        return input
-            .replace(/[<>'";&()]/g, '') // Remove dangerous characters
-            .trim()
-            .substring(0, 100); // Limit length
-    }
+    private sanitizeInput(input: string): string {}
 
     async getWeather(input: WeatherInput): Promise<string> {
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "https://geocoding-api.open-meteo.com/v1/search?name=London&count=1&language=en&format=json"
Received
->     1: "https://geocoding-api.open-meteo.com/v1/search?name=undefined&count=1&language=en&format=json"
       2: "https://api.open-meteo.com/v1/forecast?latitude=51.5074&longitude=-0.1278&hourly=temperature_2m&mode

[Survived] MethodExpression
src/services/weather.ts:9:16
 
     private sanitizeInput(input: string): string {
         // Remove potentially dangerous characters and limit length
-        return input
-            .replace(/[<>'";&()]/g, '') // Remove dangerous characters
-            .trim()
-            .substring(0, 100); // Limit length
+        return input.replace(/[<>'";&()]/g, '') // Remove dangerous characters
+.trim(); // Limit length
     }
 

[Survived] MethodExpression
src/services/weather.ts:9:16
 
     private sanitizeInput(input: string): string {
         // Remove potentially dangerous characters and limit length
-        return input
-            .replace(/[<>'";&()]/g, '') // Remove dangerous characters
-            .trim()
+        return input.replace(/[<>'";&()]/g, '') // Remove dangerous characters
             .substring(0, 100); // Limit length
     }

[Killed] Regex
src/services/weather.ts:10:22
     private sanitizeInput(input: string): string {
         // Remove potentially dangerous characters and limit length
         return input
-            .replace(/[<>'";&()]/g, '') // Remove dangerous characters
+            .replace(/[^<>'";&()]/g, '') // Remove dangerous characters
             .trim()
             .substring(0, 100); // Limit length
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: SyntaxError: Unexpected token 'E', "Error: Inv"... is not valid JSON

[Survived] StringLiteral
src/services/weather.ts:10:37
     private sanitizeInput(input: string): string {
         // Remove potentially dangerous characters and limit length
         return input
-            .replace(/[<>'";&()]/g, '') // Remove dangerous characters
+            .replace(/[<>'";&()]/g, "Stryker was here!") // Remove dangerous characters
             .trim()
             .substring(0, 100); // Limit length

[Killed] BlockStatement
src/services/weather.ts:18:58
     async getWeather(input: WeatherInput): Promise<string> {
         try {
             // Validate and sanitize input
-            if (!input.city || input.city.trim() === '') {
-                return 'Error: City name cannot be empty';
-            }
+            if (!input.city || input.city.trim() === '') {}
 
             const sanitizedCity = this.sanitizeInput(input.city);
killedBy: WeatherService getWeather should handle empty city input
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error: City name cannot be empty"
Received string:    "Error: Invalid city name provided"

[Killed] BooleanLiteral
src/services/weather.ts:18:17
     async getWeather(input: WeatherInput): Promise<string> {
         try {
             // Validate and sanitize input
-            if (!input.city || input.city.trim() === '') {
+            if (input.city || input.city.trim() === '') {
                 return 'Error: City name cannot be empty';
             }
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: SyntaxError: Unexpected token 'E', "Error: Cit"... is not valid JSON

[Killed] StringLiteral
src/services/weather.ts:19:24
         try {
             // Validate and sanitize input
             if (!input.city || input.city.trim() === '') {
-                return 'Error: City name cannot be empty';
+                return "";
             }
 
killedBy: WeatherService getWeather should handle empty city input
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error: City name cannot be empty"
Received string:    ""

[Killed] ConditionalExpression
src/services/weather.ts:23:17
             }
 
             const sanitizedCity = this.sanitizeInput(input.city);
-            if (sanitizedCity === '') {
+            if (true) {
                 return 'Error: Invalid city name provided';
             }
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: SyntaxError: Unexpected token 'E', "Error: Inv"... is not valid JSON

[Killed] EqualityOperator
src/services/weather.ts:23:17
             }
 
             const sanitizedCity = this.sanitizeInput(input.city);
-            if (sanitizedCity === '') {
+            if (sanitizedCity !== '') {
                 return 'Error: Invalid city name provided';
             }
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: SyntaxError: Unexpected token 'E', "Error: Inv"... is not valid JSON

[Killed] BlockStatement
src/services/weather.ts:32:38
                 `${WeatherService.GEOCODING_API}?name=${encodeURIComponent(sanitizedCity)}&count=1&language=en&format=json`
             );
             
-            if (!geocodeResponse.ok) {
-                return `Error fetching location data: ${geocodeResponse.status} ${geocodeResponse.statusText}`;
-            }
+            if (!geocodeResponse.ok) {}
             
             const geocodeData: GeocodingResult = await geocodeResponse.json();
killedBy: WeatherService getWeather should handle geocoding API errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error fetching location data"
Received string:    "Error: City not found. Please check the spelling and try again."

[Killed] ConditionalExpression
src/services/weather.ts:32:17
                 `${WeatherService.GEOCODING_API}?name=${encodeURIComponent(sanitizedCity)}&count=1&language=en&format=json`
             );
             
-            if (!geocodeResponse.ok) {
+            if (false) {
                 return `Error fetching location data: ${geocodeResponse.status} ${geocodeResponse.statusText}`;
             }
killedBy: WeatherService getWeather should handle geocoding API errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error fetching location data"
Received string:    "Error: City not found. Please check the spelling and try again."

[Killed] ConditionalExpression
src/services/weather.ts:39:17
             const geocodeData: GeocodingResult = await geocodeResponse.json();
 
             // Handle city not found
-            if (!geocodeData.results || geocodeData.results.length === 0) {
+            if (true) {
                 return 'Error: City not found. Please check the spelling and try again.';
             }
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: SyntaxError: Unexpected token 'E', "Error: Cit"... is not valid JSON

[Killed] BooleanLiteral
src/services/weather.ts:39:17
             const geocodeData: GeocodingResult = await geocodeResponse.json();
 
             // Handle city not found
-            if (!geocodeData.results || geocodeData.results.length === 0) {
+            if (geocodeData.results || geocodeData.results.length === 0) {
                 return 'Error: City not found. Please check the spelling and try again.';
             }
killedBy: WeatherService getWeather should return weather data for a valid city
statusReason: SyntaxError: Unexpected token 'E', "Error: Cit"... is not valid JSON

[Killed] StringLiteral
src/services/weather.ts:40:24
 
             // Handle city not found
             if (!geocodeData.results || geocodeData.results.length === 0) {
-                return 'Error: City not found. Please check the spelling and try again.';
+                return "";
             }
 
killedBy: WeatherService getWeather should handle city not found error
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error: City not found"
Received string:    ""

[Killed] ConditionalExpression
src/services/weather.ts:49:17
                 `${WeatherService.WEATHER_API}?latitude=${latitude}&longitude=${longitude}&hourly=temperature_2m&models=ukmo_seamless&current=temperature_2m,apparent_temperature,is_day,rain`
             );
             
-            if (!weatherResponse.ok) {
+            if (false) {
                 return `Error fetching weather data: ${weatherResponse.status} ${weatherResponse.statusText}`;
             }
killedBy: WeatherService getWeather should handle weather API errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error fetching weather data"
Received string:    "{
  \"error\": \"Weather service unavailable\"
}"

[Killed] BlockStatement
src/services/weather.ts:49:38
                 `${WeatherService.WEATHER_API}?latitude=${latitude}&longitude=${longitude}&hourly=temperature_2m&models=ukmo_seamless&current=temperature_2m,apparent_temperature,is_day,rain`
             );
             
-            if (!weatherResponse.ok) {
-                return `Error fetching weather data: ${weatherResponse.status} ${weatherResponse.statusText}`;
-            }
+            if (!weatherResponse.ok) {}
             
             const weatherData: WeatherData = await weatherResponse.json();
killedBy: WeatherService getWeather should handle weather API errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error fetching weather data"
Received string:    "{
  \"error\": \"Weather service unavailable\"
}"

[Killed] BlockStatement
src/services/weather.ts:56:25
             const weatherData: WeatherData = await weatherResponse.json();
 
             return JSON.stringify(weatherData, null, 2);
-        } catch (error) {
-            return `Error retrieving weather: ${error instanceof Error ? error.message : 'Unknown error'}`;
-        }
+        } catch (error) {}
     }
 }
killedBy: WeatherService getWeather should handle network errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] StringLiteral
src/services/weather.ts:57:90
 
             return JSON.stringify(weatherData, null, 2);
         } catch (error) {
-            return `Error retrieving weather: ${error instanceof Error ? error.message : 'Unknown error'}`;
+            return `Error retrieving weather: ${error instanceof Error ? error.message : ""}`;
         }
     }
