[Killed] ArrayDeclaration
src/utils/registry.ts:8:14
 const weatherService = new WeatherService();
 
 export const serviceRegistry: ServiceRegistry = {
-    weather: [
-        {
-            name: "getWeather",
-            description: "Get the current weather for a given location",
-            inputSchema: WeatherSchema,
-            handler: async (input) => await weatherService.getWeather(input)
-        }
-    ]
+    weather: []
     // Future services can be added here:
     // finance: [...],
killedBy: utils/registry should return all registered tools
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ObjectLiteral
src/utils/registry.ts:9:9
 
 export const serviceRegistry: ServiceRegistry = {
     weather: [
-        {
-            name: "getWeather",
-            description: "Get the current weather for a given location",
-            inputSchema: WeatherSchema,
-            handler: async (input) => await weatherService.getWeather(input)
-        }
+        {}
     ]
     // Future services can be added here:
killedBy: utils/registry should return all registered tools
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "name"
Received path: []

Expected value: "getWeather"
Received value: {}

[Killed] StringLiteral
src/utils/registry.ts:10:19
 export const serviceRegistry: ServiceRegistry = {
     weather: [
         {
-            name: "getWeather",
+            name: "",
             description: "Get the current weather for a given location",
             inputSchema: WeatherSchema,
killedBy: utils/registry should return all registered tools
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "name"

Expected value: "getWeather"
Received value: ""

[Survived] ArrowFunction
src/utils/registry.ts:13:22
             name: "getWeather",
             description: "Get the current weather for a given location",
             inputSchema: WeatherSchema,
-            handler: async (input) => await weatherService.getWeather(input)
+            handler: () => undefined
         }
     ]

[Killed] BlockStatement
src/utils/registry.ts:23:31
     // etc.
 };
 
-export function getAllTools() {
-    const tools: Array<{
-        name: string;
-        description: string;
-        inputSchema: any;
-        handler: (input: any) => Promise<string>;
-    }> = [];
-
-    Object.values(serviceRegistry).forEach(serviceTools => {
-        tools.push(...serviceTools);
-    });
-
-    return tools;
-}
+export function getAllTools() {}
 
killedBy: utils/registry should return all registered tools
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/registry.ts:31:60
         handler: (input: any) => Promise<string>;
     }> = [];
 
-    Object.values(serviceRegistry).forEach(serviceTools => {
-        tools.push(...serviceTools);
-    });
+    Object.values(serviceRegistry).forEach(serviceTools => {});
 
     return tools;
killedBy: utils/registry should return all registered tools
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0
