[Killed] ObjectLiteral
src/types/weather.ts:28:39
     }>;
 }
 
-export const WeatherSchema = z.object({
-    city: z.string().min(1, "City name cannot be empty").describe("The city to get the weather for")
-});
+export const WeatherSchema = z.object({});
 
 export type WeatherInput = z.infer<typeof WeatherSchema>;
killedBy: Weather Types and Schemas WeatherSchema should validate correct weather input
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "city": "London",
- }
